IdeaRS.OpenModel.Geometry2D.Vector2D
Represents a vector in two-dimensional space.

IdeaRS.OpenModel.Geometry2D.Vector2D.X
Gets or sets the X-dirrection value

IdeaRS.OpenModel.Geometry2D.Vector2D.Y
Gets or sets the Y-dirrection value